# Первый и последний игроки
# list_players = ["Маша", "Петя", "Саша", "Оля", "Кирилл"]
# reestr = {'1':"Маша",'2':"Петя",'3':"Саша",'4':"Оля",'5':"Кирилл"}
# last_player = list_players[4]
# print ("Первый игрок -", reestr['1'],", последний игрок -",last_player)#Первый и последний игрок

# Удаление дубликатов
# shopping_list = ["яблоко", "молоко", "хлеб", "яблоко","масло", "яйца", "молоко"]
# unique_items = set(shopping_list)
# uniq = len(unique_items)
# print (uniq)

# Первый и последний лыжник
# list_participants = ["Орлов", "Петров", "Иванов", "Сидоров", "Васильев","Черепахин"]
# winner = {'1':"Орлов",'2':"Петров",'3':"Иванов",'4':"Сидоров",'5':"Васильев",'6':"Черепахин"}
# last_participant = list_participants[5]
# print ("Победитель -", winner['1'],", последний лыжник -",last_participant)

# Покупки в интернет магазине
# shopping_list = ["Палатка", "Спальник", "Котелок", "Тренога", "Рюкзак", "Спальник","Рюкзак", "Термос", "Миска", "Ветровка", "Коврик" ]
# unique_items = set(shopping_list)
# unique = len(unique_items)
# print (unique)